# CloudMotion + Personal Dev Machine Setup
# Run: brew bundle install --file=Brewfile

# Taps
tap "dopplerhq/cli"
tap "sst/tap"

# ============ CLI Essentials ============
brew "bash"                        # Updated bash
brew "git"
brew "gh"                          # GitHub CLI
brew "bat"                         # Better cat with syntax highlighting
brew "ripgrep"                     # Fast grep alternative
brew "fd"                          # Fast find alternative
brew "fzf"                         # Fuzzy finder
brew "eza"                         # Modern ls replacement
brew "jq"                          # JSON processor
brew "tree"                        # Directory tree viewer
brew "tldr"                        # Simplified man pages
brew "zoxide"                      # Smarter cd command
brew "neovim"                      # Modern Vim
brew "tmux"                        # Terminal multiplexer
brew "lazygit"                     # Git TUI
brew "lazydocker"                  # Docker TUI
brew "lazysql"                     # Database TUI
brew "lazyjj"                      # Jujutsu TUI
brew "starship"                    # Cross-shell prompt
brew "difftastic"                  # Structural diff tool
brew "carapace"                    # Multi-shell completion
brew "wget"                        # File downloader
brew "gnupg"                       # GPG encryption
brew "pandoc"                      # Document converter
brew "docker"                      # Container runtime
brew "jj"                          # jujutsu DVCS

# ============ Zsh Plugins ============
brew "zsh-vi-mode"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# ============ Languages & Runtimes ============
brew "php"
brew "composer"
brew "uv"                          # Fast Python package manager

# ============ DevOps ============

# ============ AI Tools ============

# ============ Apps ============
# Browsers
cask "google-chrome"
cask "brave-browser"

# Communication

# Office

# Development
cask "visual-studio-code"
cask "kitty"                       # Fast terminal emulator
cask "ghostty"                     # GPU-accelerated terminal
cask "cmux"                        # Terminal multiplexer app
cask "orbstack"                    # Docker Desktop alternative

# Design

# Productivity
cask "obsidian"                    # Knowledge base / notes
cask "raycast"                     # Spotlight replacement

# Utilities
cask "appcleaner"
cask "caffeine"
cask "karabiner-elements"          # Keyboard customization

# Fonts
cask "font-blex-mono-nerd-font"        # IBM Plex Mono with Nerd Font icons (terminal/editor)
# cask "font-jetbrains-mono-nerd-font"  # JetBrains Mono with Nerd Font icons (terminal/editor)
